In [1]:
import pymysql

In [5]:
import pandas as pd

In [2]:
def create_database_connection():
    connection = pymysql.connect(
        host="localhost",
        user="root",
        password="020914@Pqs",
    )
    return connection

In [3]:
def get_db_connection(database_name):
    connection = pymysql.connect(
        host="localhost",
        user="root",
        password="020914@Pqs",
        database=database_name
    )
    return connection

In [4]:
cn = create_database_connection()

In [6]:
cn.close()

Error: Already closed

In [7]:
connect = get_db_connection('hw3')

In [8]:
cursor = connect.cursor()
cursor.execute("show tables;")

5

In [9]:
cursor.fetchall()

(('courses',), ('enrollments',), ('instructors',), ('students',), ('teaches',))

In [10]:
cursor.execute("desc courses;")

3

In [11]:
cursor.fetchall()

(('courseID', 'int', 'NO', 'PRI', None, ''),
 ('courseName', 'text', 'YES', '', None, ''),
 ('creditHours', 'int', 'YES', '', None, ''))

In [12]:
connect.select_db('testing2')

In [13]:
cursor.execute("show tables;")

0

In [14]:
cursor.execute("create database if not exists testing2;")

1

In [6]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [7]:
df = pd.read_csv("coffee_shop_sales.csv")

In [8]:
df

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail
0,17,1/1/2023,7:59:58,1,5,Lower Manhattan,79,3.75,Bakery,Scone,Jumbo Savory Scone
1,23,1/1/2023,8:24:26,1,5,Lower Manhattan,69,3.25,Bakery,Biscotti,Hazelnut Biscotti
2,36,1/1/2023,8:58:55,1,5,Lower Manhattan,26,3.00,Coffee,Organic brewed coffee,Brazilian Rg
3,58,1/1/2023,9:22:46,1,5,Lower Manhattan,34,2.45,Coffee,Premium brewed coffee,Jamaican Coffee River Sm
4,109,1/1/2023,11:03:25,2,5,Lower Manhattan,47,3.00,Tea,Brewed Green tea,Serenity Green Tea Lg
...,...,...,...,...,...,...,...,...,...,...,...
9995,149388,6/30/2023,18:30:02,1,5,Lower Manhattan,72,3.25,Bakery,Scone,Ginger Scone
9996,149411,6/30/2023,19:03:24,2,3,Astoria,48,2.50,Tea,Brewed Black tea,English Breakfast Rg
9997,149419,6/30/2023,19:15:30,1,3,Astoria,53,3.00,Tea,Brewed Chai tea,Traditional Blend Chai Lg
9998,149425,6/30/2023,19:25:52,1,3,Astoria,43,3.00,Tea,Brewed herbal tea,Lemon Grass Lg
9999,149440,6/30/2023,19:46:02,2,8,Hell's Kitchen,55,4.00,Tea,Brewed Chai tea,Morning Sunrise Chai Lg

In [9]:
transactions = df[['transaction_id', 'transaction_date', 'transaction_time', 'transaction_qty', 'store_id', 'product_id']]
stores = df[['store_id', 'store_location']]
products = df[['product_id', 'unit_price', 'product_category', 'product_type', 'product_detail']]

In [10]:
stores

      store_id   store_location
0            5  Lower Manhattan
1            5  Lower Manhattan
2            5  Lower Manhattan
3            5  Lower Manhattan
4            5  Lower Manhattan
...        ...              ...
9995         5  Lower Manhattan
9996         3          Astoria
9997         3          Astoria
9998         3          Astoria
9999         8   Hell's Kitchen

[10000 rows x 2 columns]

In [16]:
# stores.to_csv('stores.csv', index=False)

In [18]:
# products.to_csv('products.csv', index=False)

In [14]:
stores = stores.drop_duplicates()

In [15]:
stores

   store_id   store_location
0         5  Lower Manhattan
5         3          Astoria
6         8   Hell's Kitchen

In [17]:
products = products.drop_duplicates()
products

,product_id,unit_price,product_category,product_type,product_detail
0,79,3.75,Bakery,Scone,Jumbo Savory Scone
1,69,3.25,Bakery,Biscotti,Hazelnut Biscotti
2,26,3.00,Coffee,Organic brewed coffee,Brazilian Rg
3,34,2.45,Coffee,Premium brewed coffee,Jamaican Coffee River Sm
4,47,3.00,Tea,Brewed Green tea,Serenity Green Tea Lg
...,...,...,...,...,...
2155,7,19.75,Coffee beans,Premium Beans,Jamacian Coffee River
2613,75,4.38,Bakery,Pastry,Croissant
2647,5,15.00,Coffee beans,Gourmet Beans,Columbian Medium Roast
4155,78,5.63,Bakery,Scone,Scottish Cream Scone
4162,79,4.69,Bakery,Scone,Jumbo Savory Scone

In [22]:
transactions['transaction_date']

0        1/1/2023
1        1/1/2023
2        1/1/2023
3        1/1/2023
4        1/1/2023
          ...
9995    6/30/2023
9996    6/30/2023
9997    6/30/2023
9998    6/30/2023
9999    6/30/2023
Name: transaction_date, Length: 10000, dtype: object

In [24]:
transactions['transaction_date'] = pd.to_datetime(transactions['transaction_date'], format='%m/%d/%Y').dt.strftime('%Y-%m-%d')

C:\Users\62398\AppData\Local\Temp\ipykernel_36236\1675188645.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  transactions['transaction_date'] = pd.to_datetime(transactions['transaction_date'], format='%m/%d/%Y').dt.strftime('%Y-%m-%d')

In [27]:
transactions = transactions.drop_duplicates()
transactions

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,product_id
0,17,2023-01-01,7:59:58,1,5,79
1,23,2023-01-01,8:24:26,1,5,69
2,36,2023-01-01,8:58:55,1,5,26
3,58,2023-01-01,9:22:46,1,5,34
4,109,2023-01-01,11:03:25,2,5,47
...,...,...,...,...,...,...
9995,149388,2023-06-30,18:30:02,1,5,72
9996,149411,2023-06-30,19:03:24,2,3,48
9997,149419,2023-06-30,19:15:30,1,3,53
9998,149425,2023-06-30,19:25:52,1,3,43
9999,149440,2023-06-30,19:46:02,2,8,55

In [28]:
# transactions.to_csv('transactions.csv', index=False)

In [33]:
product = pd.read_csv("products.csv")
product['product_id'].value_counts()

product_id
79    1
69    1
20    1
84    1
18    1
     ..
22    1
58    1
51    1
46    1
78    1
Name: count, Length: 80, dtype: int64

In [34]:
s = pd.read_csv("Salaries.csv")
s

       yearID teamID lgID   playerID    salary
0        1985    ATL   NL  barkele01    870000
1        1985    ATL   NL  bedrost01    550000
2        1985    ATL   NL  benedbr01    545000
3        1985    ATL   NL   campri01    633333
4        1985    ATL   NL  ceronri01    625000
...       ...    ...  ...        ...       ...
25570    2015    WAS   NL  treinbl01    512800
25571    2015    WAS   NL  ugglada01    507500
25572    2015    WAS   NL  werthja01  21000000
25573    2015    WAS   NL  zimmejo02  16500000
25574    2015    WAS   NL  zimmery01  14000000

[25575 rows x 5 columns]

In [35]:
s.columns=["year","team","lg","playerID", 'salary']
s

       year team  lg   playerID    salary
0      1985  ATL  NL  barkele01    870000
1      1985  ATL  NL  bedrost01    550000
2      1985  ATL  NL  benedbr01    545000
3      1985  ATL  NL   campri01    633333
4      1985  ATL  NL  ceronri01    625000
...     ...  ...  ..        ...       ...
25570  2015  WAS  NL  treinbl01    512800
25571  2015  WAS  NL  ugglada01    507500
25572  2015  WAS  NL  werthja01  21000000
25573  2015  WAS  NL  zimmejo02  16500000
25574  2015  WAS  NL  zimmery01  14000000

[25575 rows x 5 columns]

In [36]:
s['playerID'].value_counts()

playerID
moyerja01    25
vizquom01    24
glavito02    23
griffke02    22
bondsba01    22
             ..
brewija01     1
hansecr01     1
burgoen01     1
faneyri01     1
treinbl01     1
Name: count, Length: 4963, dtype: int64

In [37]:
s = s.drop_duplicates(subset=['playerID'])
s['playerID'].value_counts()

playerID
barkele01    1
youklke01    1
clausbr01    1
belisma01    1
leicejo01    1
            ..
astacpe01    1
ashlebi01    1
pichahi01    1
meachru01    1
treinbl01    1
Name: count, Length: 4963, dtype: int64

In [39]:
# s.to_csv('salaries.csv', index=False)
s

       year team  lg   playerID  salary
0      1985  ATL  NL  barkele01  870000
1      1985  ATL  NL  bedrost01  550000
2      1985  ATL  NL  benedbr01  545000
3      1985  ATL  NL   campri01  633333
4      1985  ATL  NL  ceronri01  625000
...     ...  ...  ..        ...     ...
25546  2015  WAS  NL  barreaa01  514200
25548  2015  WAS  NL  dendema01  512972
25562  2015  WAS  NL  robincl01  525000
25568  2015  WAS  NL  taylomi02  508700
25570  2015  WAS  NL  treinbl01  512800

[4963 rows x 5 columns]

In [40]:
s.to_csv('salaries.csv', index=False)